#Область СлужебныеПроцедурыИФункции
// Добавление элементов на форму 
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, на которой необходимо разместить Элементы.
//
Процедура КИР_ДоработкаФормы(Форма)Экспорт
	//{{Начало доработки
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьКонтакноеЛицоНаформуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьКонтакноеЛицоНаформуПередСуммаДокумента(Форма);
	КонецЕсли;   
	//КонецДоработки}}
	
КонецПроцедуры 


Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма)
	//{{Начало доработки
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.ПутьКДанным = "Объект.КИР_КонтактноеЛицо"; 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Заголовок = "Контактное лицо";
	//КонецДоработки}}
КонецПроцедуры

Процедура ВставитьКонтакноеЛицоНаформуПередСуммаДокумента(Форма)
    //{{Начало доработки
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	ПолеВвода.ПутьКДанным = "Объект.КИР_КонтактноеЛицо"; 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.Заголовок = "Контактное лицо"; 
	//КонецДоработки}}
КонецПроцедуры  

Процедура ВставитьКонтакноеЛицоНаформуПередОснование(Форма)
    //{{Начало доработки
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.Основание);
	ПолеВвода.ПутьКДанным = "Объект.КИР_КонтактноеЛицо"; 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВвода.Заголовок = "Контактное лицо"; 
	//КонецДоработки}}
КонецПроцедуры
#КонецОбласти
